[
  {
    "company": "Philippine Digital Asset Exchange (PDAX)",
    "position": "Senior Associate Software Quality Engineer",
    "summary": "Architected and implemented a scalable and comprehensive quality engineering infrastructure, focusing on automation, performance, and streamlined collaboration. Developed robust automation frameworks and a performance testing ecosystem to ensure high-quality software delivery.",
    "country": "Philippines",
    "modality": "On-site",
    "type": "Full-time",
    "startedAt": "2025-04",
    "endedAt": null,
    "technologies": [
      "Amazon Web Services (AWS)",
      "AWS EC2",
      "Containerization",
      "Docker",
      "Hashicorp Vault",
      "Reverse Proxy",
      "Nginx",
      "Continuous Integration (CI)",
      "Jenkins",
      "Slack Integration",
      "Test Automation",
      "Performance Testing",
      "Grafana",
      "Grafana K6",
      "InfluxDB",
      "Typescript",
      "Functional Testing",
      "Robot Framework",
      "Allure",
      "Robot Framework Requests",
      "Robot Framework Appium",
      "Browserstack",
      "Grafana Loki"
    ],
    "highlights": [
      "Built scalable automation frameworks for backend and mobile testing using Robot Framework, Appium, BrowserStack, Jenkins, and Hashicorp Vault with both CI and on-demand pipelines.",
      "Designed and implemented a performance testing ecosystem with Grafana K6, InfluxDB, Grafana, and Loki, enabling real-time monitoring, reporting, and scalable load testing.",
      "Established a centralized QE infrastructure leveraging Docker, Nginx, Jenkins, Vault, Grafana, Grafana Loki, and InfluxDB to streamline test execution, reporting, and team collaboration."
    ]
  },
  {
    "company": "Philippine Digital Asset Exchange (PDAX)",
    "position": "Software Quality Engineer Intern",
    "summary": "Created test automation continuous integration pipelines for a backend and client application. Designed and implemented a CI/CD pipeline to streamline the testing and code analysis process.",
    "country": "Philippines",
    "modality": "On-site",
    "type": "Internship",
    "startedAt": "2025-02",
    "endedAt": "2025-04",
    "technologies": [
      "CI/CD",
      "Automation Testing",
      "Jenkins",
      "Robot Framework",
      "Docker",
      "Docker-in-Docker",
      "Containerization",
      "Sonarqube",
      "FastAPI",
      "PydanticAI",
      "Typescript",
      "React"
    ],
    "highlights": [
      "Built an API and client app of an implementation of an AI agent using FastAPI and PyanticAI for API and Typescript and React for client side.",
      "Developed test automation scripts for thereof using Robot Framework with its playwright and requests implementation to address and test the API and client app.",
      "Designed the pipeline using jenkins with hybrid testing methodology of implementing unit tests and static code analysis using SonarQube on feature branch push and smoke tests on develop branch pull request then full test on pull request to master."
    ]
  },
  {
    "company": "Navigent",
    "position": "Backend & AI Agent Workflow Engineer",
    "summary": "Specialized in creating and deploying voice AI agents for business automation. Developed backend APIs and integrated various tools to manage complex conversational flows and data models, focusing on enhancing customer interaction.",
    "country": "Taiwan",
    "modality": "Remote",
    "type": "Internship",
    "startedAt": "2025-01",
    "endedAt": "2025-02",
    "technologies": [
      "N8N",
      "VAPI",
      "NocoDB",
      "FastAPI",
      "PydanticAI",
      "Pydantic",
      "Python"
    ],
    "highlights": [
      "Developed 2 voice AI agent for a restaurant business and a construction firm using N8N, VAPI, NocoDB, Twillio, FastAPI, PydanticAI, and OpenRouter ",
      "Designed and implemented voice interaction flows using N8N and VAPI to handle customer inquiries and automate customer making a booking or an order via voice alone.",
      "Build backend APIs with FastAPI and structured data models with PydanticAI for agent reasoning."
    ]
  },
  {
    "company": "Freelance",
    "position": "Backend & Machine Learning Engineer",
    "summary": "Developed a machine learning-based system for legal document analysis. Focused on creating a scalable pipeline for natural language processing and inference to automate document evaluation and validation.",
    "country": "Philippines",
    "modality": "Remote",
    "type": "Contract",
    "startedAt": "2024-09",
    "endedAt": "2024-12",
    "technologies": [
      "Cloudflare",
      "Tunnelling",
      "Zero Trust",
      "Containerization",
      "Docker",
      "Reverse Proxy",
      "Nginx",
      "Pocketbase",
      "Flask",
      "Python",
      "Express.js",
      "Javascript",
      "Typescript",
      "OpenAPI",
      "Data Science",
      "Machine Learning",
      "Scikit Learn",
      "Natural Language Processing (NLP)",
      "Text Tokenization",
      "Global Vectors for Word Representation (GLoVe)",
      "Sentece Transformers (SBERT)"
    ],
    "highlights": [
      "Created a machine learning and NLP-based document attribution system for assessing the HGDG alignment of a legal document, automating evaluation and validation with a focus on scalability.",
      "Designed a pipeline to tokenize and embed document text using GloVe and SBERT embeddings, extract the most relevant sentences for specific questions using cosine similarity, and validate responses through Natural Language Inference (NLI).",
      "Built a robust backend infrastructure using Flask and Flask-RESTX, containerized with Docker, and deployed with Gunicorn for production readiness."
    ]
  },
  {
    "company": "Freelance",
    "position": "Flutter & React Developer",
    "summary": "Developed a virtual tour system consisting of a kiosk application and a web app. Focused on creating immersive user experiences and efficient data management for both platforms.",
    "country": "Philippines",
    "modality": "Remote",
    "type": "Contract",
    "startedAt": "2024-06",
    "endedAt": "2024-12",
    "technologies": [
      "Containerization",
      "Docker",
      "Reverse Proxy",
      "Nginx",
      "React",
      "ShadcnUI",
      "TailwindCSS",
      "Typescript",
      "Pocketbase",
      "Flutter"
    ],
    "highlights": [
      "Created a kiosk application using Flutter/Dart with virtual tour functionality to enhance organizational engagement.",
      "Developed the virtual tour web app with React, TypeScript, ShadcnUI, and TailwindCSS, integrating Pannellum for 360° panorama views.",
      "Implemented TanStack Query for efficient state management and optimized API interactions."
    ]
  },
  {
    "company": "Freelance",
    "position": "Full-Stack Developer",
    "summary": "Developed a virtual storefront for a Japanese jewelry business. Focused on creating a responsive and seamless e-commerce experience, handling both front-end and back-end development.",
    "country": "Japan",
    "modality": "Remote",
    "type": "Contract",
    "startedAt": "2023-11",
    "endedAt": "2024-05",
    "technologies": [
      "Typescript",
      "Next.js",
      "React",
      "TailwindCSS",
      "ShadcnUI",
      "Supabase",
      "PostgreSQL"
    ],
    "highlights": [
      "Developed a virtual storefront application for a Japan-based jewelry business using Next.js, TailwindCSS, ShadcnUI, Supabase, PostgreSQL, and TanStack Query.",
      "Built a responsive storefront application with Next.js, leveraging TailwindCSS and ShadcnUI for UI design.",
      "Integrated Maya Payment to facilitate seamless online transactions."
    ]
  }
]
