[
  {
    "title": "Anonalyze - An NLP-Enhanced and ML-Driven Platform for Sentiment and Insight Extraction",
    "image": "anonalyze.png",
    "description": "Anonalyze is a platform built to transform unstructured feedback into actionable insights using Natural Language Processing (NLP) and Machine Learning (ML). Originally developed as a thesis project, it empowers users to gather and analyze anonymous feedback, track sentiment trends, and unlock valuable insights from diverse audiences.",
    "repositoryURL": "https://github.com/hyoaru/anonalyze",
    "liveURL": "https://anonalyze.org",
    "processURL": null,
    "tags": [
      "Typescript",
      "PHP",
      "Python",
      "React",
      "Laravel",
      "Flask",
      "Swagger",
      "Scikit-learn",
      "Nginx",
      "Docker",
      "Machine Learning",
      "Naive Bayes",
      "Multinomial Classification",
      "Term-Frequency Inverse Document Frequency",
      "Rapid Automatic Keyword Extraction",
      "LLM Integration",
      "Reverse Proxy",
      "Load Balancing",
      "API-First Architecture",
      "Cloudflare"
    ],
    "year": 2024
  },
  {
    "title": "Cookhaina Directory - Flutter",
    "image": "cookhaina-directory-flutter.png",
    "description": "A course requirement in CS Elective 3, this project is a digital cookbook application built with Flutter and powered by TheMealDB API. The app allows users to browse, search, and view recipes with detailed instructions, images, and ingredients. It showcases modern cross-platform mobile development practices using Flutter, seamless API integration for dynamic content, and a clean user interface designed for usability and accessibility.",
    "repositoryURL": "https://github.com/hyoaru/cookhaina-directory-flutter",
    "liveURL": "https://github.com/hyoaru/cookhaina-directory-flutter/releases",
    "processURL": null,
    "tags": ["Dart", "Flutter"],
    "year": 2024
  },
  {
    "title": "RM Collection Virtual Storefront Platform",
    "image": "rm-collection.png",
    "description": "Developed as a course requirement in CS Elective 2, this project is a full-featured virtual storefront platform designed for a jewelry wholesaler based in Japan. The platform was built with modern web technologies such as TypeScript, Next.js, React, and TanStack, and styled with Shadcn UI and TailwindCSS to ensure a clean, responsive, and intuitive user experience. It integrates Supabase as a backend service for authentication, database, and real-time data management, while hosting and deployment are handled via Vercel for seamless CI/CD. The application simulates an e-commerce environment, allowing product browsing, catalog management, and user interaction features, effectively bridging design, functionality, and scalability in a production-ready manner.",
    "repositoryURL": "https://github.com/hyoaru/rm-collection",
    "liveURL": "https://rea-mariz-collection.vercel.app",
    "processURL": null,
    "tags": [
      "TypeScript",
      "Next.js",
      "React",
      "Tanstack",
      "ShadcnUi",
      "TailwindCSS",
      "Supabase",
      "Vercel"
    ],
    "year": 2023
  },
  {
    "title": "Portfolio V2",
    "image": "portfolio-v2.png",
    "description": "Portfolio V2 is a personal portfolio website I developed during my 3rd year of college to showcase my projects, skills, and experiences. Built with React and TypeScript, it features a modern, responsive design styled using TailwindCSS and NextUI components. The portfolio highlights interactive UI elements, smooth navigation, and clean layouts to effectively present my work to potential collaborators or employers. This project reflects my early exploration into web development best practices, component-based architecture, and design consistency, serving as a foundation for later iterations of my personal portfolio.",
    "repositoryURL": "https://github.com/hyoaru/portfolio-v2",
    "liveURL": "https://hyoaru.github.io/portfolio-v2/",
    "processURL": null,
    "tags": ["React", "Typescript", "Tailwind", "NextUI"],
    "year": 2023
  },
  {
    "title": "Beyond Decor Portfolio And Inquiry Website",
    "image": "beyond-decor.png",
    "description": "Developed as a course requirement for AL102, the Beyond Decor Portfolio and Inquiry Website is a full-featured platform for a party and entertainment service. Built using Next.js and React, and styled with TailwindCSS and DaisyUI, the website provides a visually appealing and responsive portfolio to showcase the company’s services and past events. It incorporates Pocketbase for backend data management, enabling seamless handling of inquiries and client submissions. Hosted on Vercel, the platform demonstrates modern web development practices, combining clean UI design, dynamic content management, and interactive features to enhance user experience and engagement. This project highlights my skills in full-stack development, responsive design, and integrating frontend and backend solutions into a cohesive application.",
    "repositoryURL": "https://github.com/hyoaru/beyond-decor",
    "liveURL": "https://beyond-decor.vercel.app",
    "processURL": null,
    "tags": [
      "Next.js",
      "React",
      "DaisyUi",
      "TailwindCSS",
      "Pocketbase",
      "Vercel"
    ],
    "year": 2023
  },
  {
    "title": "Google Data Analytics Capstone Case Study",
    "image": "google-data-analytics-capstone.png",
    "description": "A comprehensive case study for a fictional Chicago-based bike share company, completed as part of the Google Data Analytics Capstone. The project involved data cleaning, transformation, and visualization using Python and R to uncover customer behavior and usage trends. The final analysis highlighted actionable insights that could guide business strategy, particularly in improving rider retention and operational efficiency.",
    "repositoryURL": "https://github.com/hyoaru/google-data-analytics-capstone-case-study",
    "liveURL": null,
    "processURL": "https://htmlpreview.github.io/?https://github.com/hyoaru/google-data-analytics-capstone-case-study/blob/master/capstone-case-study.html",
    "tags": ["Python", "R", "Tidyverse", "Pandas", "Jupyter"],
    "year": 2023
  },
  {
    "title": "Philippine Poverty Area Estimates Web App Choropleth Visualization",
    "image": "ph-poverty-area-estimates.png",
    "description": "An interactive web application that visualizes poverty statistics in the Philippines across multiple years (2006, 2009, 2012, 2015) using a choropleth map. Developed with Streamlit and powered by Pandas, Numpy, Plotly, and Seaborn, the tool transforms raw survey data into an engaging and accessible format. It highlights regional disparities and provides policymakers, students, and researchers with an intuitive way to analyze socioeconomic trends.",
    "repositoryURL": "https://github.com/hyoaru/philippine-poverty-area-estimates-choropleth/tree/master",
    "liveURL": "https://ph-poverty-area-estimates.streamlit.app",
    "processURL": null,
    "tags": [
      "Python",
      "Pandas",
      "Numpy",
      "Seaborn",
      "Plotly",
      "Jupyter",
      "Streamlit"
    ],
    "year": 2023
  },
  {
    "title": "Data Visualization: Prime Number Forest",
    "image": "prime-number-forest.png",
    "description": "An experimental data visualization project that represents prime numbers from 1–200 as a 'forest'. Using Plotly, Pandas, and Numpy, the primes are arranged in a 3D space to create a visually striking, interactive model. Hosted on GitHub Pages, this project demonstrates creativity in data visualization and mathematical storytelling through code.",
    "repositoryURL": "https://github.com/hyoaru/prime-number-forest-3d",
    "liveURL": "https://htmlpreview.github.io/?https://github.com/hyoaru/prime-number-forest-3d/blob/master/mesh_art_plot.html",
    "processURL": null,
    "tags": ["Python", "Pandas", "Numpy", "Plotly", "Github Pages"],
    "year": 2023
  },
  {
    "title": "Portfolio V1",
    "image": "old-portfolio.png",
    "description": "My very first personal portfolio website created during my first year of college. Built with plain HTML, Bootstrap, JS and hosted on GitHub Pages, it marked my initial dive into frontend development, responsive design, and personal branding. Although simple compared to later versions, it served as a foundational project for experimenting with UI components and layout structures.",
    "repositoryURL": "https://github.com/hyoaru/portfolio-v1",
    "liveURL": "https://hyoaru.github.io/portfolio-v1/",
    "processURL": null,
    "tags": ["React", "Bootstrap", "Github Pages"],
    "year": 2022
  },
  {
    "title": "SPARTA Capstone: Data Science and Machine Learning using Python",
    "image": "sparta-data-science-and-machine-learning-using-python.png",
    "description": "A peer-graded capstone project under the SPARTA program (Smarter Philippines through Data Analytics R&D, Training, and Adoption). The project applies machine learning techniques to real-world datasets, using Scikit-learn, XGBoost, and multiple classifiers to generate predictions and evaluate model performance. It highlights skills in feature engineering, model training, and performance evaluation.",
    "repositoryURL": "https://github.com/hyoaru/sparta-data-science-and-machine-learning-using-python",
    "liveURL": null,
    "processURL": "https://htmlpreview.github.io/?https://github.com/hyoaru/sparta-data-science-and-machine-learning-using-python/blob/master/ml_ds_capstone.html",
    "tags": [
      "Python",
      "Pandas",
      "Numpy",
      "Scikit-learn",
      "Jupyter",
      "Xgboost",
      "K-Neighbours Classifier",
      "Logistic Regression",
      "Random Forest Classifier"
    ],
    "year": 2022
  },
  {
    "title": "SPARTA: Representing Data and Feature Engineering",
    "image": "sparta-representing-data-and-feature-engineering.png",
    "description": "A peer-graded SPARTA project focused on feature engineering and representation of structured data. The assignment uses the Adult Income dataset and applies Scikit-learn models such as Logistic Regression, Random Forest, and SVM. It demonstrates preprocessing pipelines, handling categorical/numeric features, and evaluating classification results.",
    "repositoryURL": "https://github.com/hyoaru/sparta-representing-data-and-feature-engineering",
    "liveURL": null,
    "processURL": "https://htmlpreview.github.io/?https://github.com/hyoaru/sparta-representing-data-and-feature-engineering/blob/master/representing_data_and_feature_engineering.html",
    "tags": [
      "Python",
      "Pandas",
      "Numpy",
      "Scikit-learn",
      "Jupyter",
      "Logistic Regression",
      "Random Forest Classifier",
      "Support Vector Machines"
    ],
    "year": 2022
  },
  {
    "title": "SPARTA: Supervised ML Binary Classification",
    "image": "sparta-supervisedml-binary-classification.png",
    "description": "A SPARTA peer-graded project focused on supervised machine learning for binary classification tasks. Using the Breast Cancer Wisconsin dataset, the project trains and compares Logistic Regression and Random Forest models, applying data preprocessing and evaluation metrics to assess prediction accuracy. It reflects foundational skills in implementing end-to-end supervised learning workflows.",
    "repositoryURL": "https://github.com/hyoaru/sparta-supervisedml-binary-classification",
    "liveURL": null,
    "processURL": "https://htmlpreview.github.io/?https://github.com/hyoaru/sparta-supervisedml-binary-classification/blob/master/breast_cancer_binary_classification.html",
    "tags": [
      "Python",
      "Pandas",
      "Numpy",
      "Scikit-learn",
      "Jupyter",
      "Logistic Regression",
      "Random Forest Classifier"
    ],
    "year": 2022
  },
  {
    "title": "SPARTA: Unsupervised ML Clustering",
    "image": "sparta-unsupervisedml-clustering.png",
    "description": "A SPARTA project focused on unsupervised learning, applying clustering algorithms to the Iris plants dataset. The project explores KMeans, DBSCAN, and Agglomerative Clustering, visualizing the results to highlight natural groupings in the data. It demonstrates the application of unsupervised techniques for pattern discovery and comparative evaluation of clustering methods.",
    "repositoryURL": "https://github.com/hyoaru/sparta-unsupervisedml-clustering",
    "liveURL": null,
    "processURL": "https://htmlpreview.github.io/?https://github.com/hyoaru/sparta-unsupervisedml-clustering/blob/master/iris_clustering.html",
    "tags": [
      "Python",
      "Pandas",
      "Numpy",
      "Scikit-learn",
      "Jupyter",
      "KMeans Clutering",
      "DBSCAN",
      "Agglomerative Clustering"
    ],
    "year": 2022
  },
  {
    "title": "Declutter",
    "image": "declutter.png",
    "description": "A minimalist web application designed to provide users with a clutter-free space to write and share their thoughts. Built with Flask and styled using Bootstrap, it integrates Supabase for database services and is deployed via Render. The project emphasizes clean UI, simplicity of interaction, and backend–frontend integration in Python web development.",
    "repositoryURL": "https://github.com/hyoaru/declutter",
    "liveURL": "https://declutter.onrender.com",
    "processURL": null,
    "tags": [
      "Python",
      "Flask",
      "HTML",
      "CSS",
      "Bootstrap",
      "Supabase",
      "Render"
    ],
    "year": 2022
  }
]
